[
    [
        {
            "comment": "this is 1914"
        },
        {
            "date": "28 มิถุนายน 1914",
            "title": "ลอบปลงพระชนม์",
            "information": "ระหว่างเสด็จพระดำเนินด้วยรถเปิดประทุนในกรุงซาราเยโวของบอสเนีย อาร์ชดยุคฟรานซ์ เฟอร์ดินานด์พร้อมด้วยพระชายาถูกลอบยิงสิ้นพระชนม์ด้วยฝีมือของ กาฟริโล พรินซิป (Gavrilo Princip) ชาวบอสเนียเชื้อสายเซิร์บ สมาชิกกลุ่ม Mlada Bosna (หรือ Young Bosnia ขบวนการปฏิวัติของคนรุ่นใหม่ในบอสเนียและเฮอร์เซโกวีนา สมาชิกส่วนใหญ่เป็นชาวเซิร์บ)",
            "picture": "assets/image/ww0.png"
        },
        {
            "date": "28 กรกฎาคม 1914",
            "title": "ประกาศสงคราม",
            "information": "ประเทศออสเตรีย-ฮังการี ได้เปิดฉากรุกรานเซอร์เบียเป็นครั้งแรก ส่วนเยอรมันที่อยู่ฝ่ายเดียวกัน ก็เปิดฉากรุกรานเบลเยียม",
            "picture": "assets/image/ww1.jpg"
        },
        {
            "date": "1 สิงหาคม 1914",
            "title": "ประกาศสงคราม",
            "information": "เยอรมันประกาศสงครามกับรัสเซีย",
            "picture": "none"
        },
        {
            "date": "2 สิงหาคม 1914",
            "title": "เซ็นสัญญาร่วมเป็นพันธมิตร",
            "information": "กรวรรดิออตโตมัน และเยอรมนี เซ็นสัญญาร่วมเป็นพันธมิตร",
            "picture": "none"
        },
        {
            "date": "3 สิงหาคม 1914",
            "title": "ประกาศสงคราม",
            "information": "&nbsp;&nbsp;&nbsp;&nbsp;เยอรมันประกาศสงครามกับฝรั่งเศสเนื่องจากฝรั่งเศสท้าทายโดยยื่นข้อเสนอว่าจะส่งกองกำลังไปช่วยเหลือรัสเซีย ทำให้เยอรมันยกพลไปโจมตีฝรั่งเศสทันที ซึ่งใช้เส้นทางของเบลเยียมที่ประกาศตัวเป็นกลาง   กลยุทธการต่อสู้ของเยอรมัน คือ รวดเร็ว สั้น ดุเดือด และคล่องตัว จึงทำให้สามารถเอาชนะฝรั่งเศสที่ไม่ทันได้ตั้งตัวได้ ส่วนอังกฤษยื่นคำขาดกับเยอรมันเรื่องการเดินทัพผ่านเข้าไปในดินแดนของเบลเยียมตาม “สัญญาค้ำประกันความเป็นกลาง” แต่ถูกเยอรมันปฏิเสธ",
            "picture": "none"
        },
        {
            "date": "4 สิงหาคม 1914",
            "title": "ประกาศสงคราม",
            "information": "&nbsp;&nbsp;&nbsp;&nbsp;อังกฤษประกาศสงครามกับเยอรมัน ทำให้ประเทศอาณานิคมของอังกฤษในขณะนั้นต้องเข้าร่วมสงครามโดยปริยาย ได้แก่ แคนาดา ออสเตรเลีย นิวซีแลนด์ อินเดีย และแอฟริกาใต้ ส่วนสหรัฐอเมริกาประกาศตัวเป็นกลาง<br><br> การปะทะที่เทนเนนเบิร์ก<br>(Battle of tannenberg)<br>&nbsp;&nbsp;&nbsp;&nbsp;เทนเนนเบิร์กเป็นหมู่บ้านเล็ก ๆ แห่งหนึ่งในปรัสเซียที่เป็นแนวรบฝั่งตะวันออก     กองพลของเยอรมันภายใต้การบัญชาการของจอมพลฮินเดนเบิร์ก (Paul von Hindenburg) และนายพลลูเดนดอฟฟ์ (Erich von Ludendorff)  ได้เข้าประจัญกับรัสเซีย การปะทะครั้งนี้เป็นการปะทะครั้งแรกของสงครามโลกครั้งที่ 1 ซึ่งใช้เวลาประมาณ 5 วัน ผลสุดท้าย กองทัพรัสเซียถูกตีแตกพ่ายปราชัยให้กับเยอรมัน คนรัสเซียนถูกจับตัวกว่า 125,000 คนและเสียชีวิตเป็นจำนวนมาก    ทั้งยังถูกขับไล่ออกจากปรัสเซียตะวันออกอีกด้วย อย่างไรก็ตาม ชัยชนะอันงดงามของเยอรมันครั้งนี้ทำให้จอมพลฮินเดนเบิร์กและนายพลลูเดนดอฟฟ์กลายเป็นวีรบุรุษของประชาชนทั่วทั้งเยอรมัน",
            "picture": "assets/image/ww2.jpg"
        },
        {
            "date": "10 สิงหาคม 1914",
            "title": "เปิดฉากต่อสู้",
            "information": "&nbsp;&nbsp;&nbsp;&nbsp;ออสเตรีย-ฮังการี บุกรุกรัสเซีย เปิดฉากต่อสู้ตรงแนวรบตะวันออกเกิดการสู้รบที่หมู่บ้านทานเนนแบร์ก ในปรัสเซีย",
            "picture": "none"
        },
        {
            "date": "12 กันยายน 1914",
            "title": "สู้รบครั้งแรกที่ฝรั่งเศษ",
            "information": "none",
            "picture": "none"
        },
        {
            "date": "3 พฤศจิกายน 1914",
            "title": "ประกาศสงคราม",
            "information": " รัสเซียประกาศสงครามกับจักรวรรดิออตโตมัน",
            "picture": "none"
        },
        {
            "date": "5 พฤศจิกายน 1914",
            "title": "ประกาศสงคราม",
            "information": " สหราชอาณาจักร และฝรั่งเศส ประกาศสงครามกับจักรวรรดิออตโตมัน",
            "picture": "none"
        }
    ],
    [
        {
            "comment": "this is 1915"
        },
        {
            "date": "7 พฤษภาคม 1915",
            "title": "จมเรืออังกฤษ",
            "information": "เรือดำน้ำเยอรมนีจมเรือเดินสมุทรลูซิเทเนียของอังกฤษ มีผู้เสียชีวิต 1,198 ราย",
            "picture": "none"
        },
        {
            "date": "19 มกราคม 1915",
            "title": "เยอรมันดัดแปลงเรือเหาะ(Zeppelins)",
            "information": "&nbsp;&nbsp;&nbsp;&nbsp;เยอรมันดัดแปลงเรือเหาะ(Zeppelins) เพื่อใช้ในการบรรทุกระเบิดทิ้งทางอากาศทำลายคู่ศัตรู โดยเริ่มต้นโจมตีเป้าหมายแรกคืออังกฤษ แต่เนื่องจากเรือเหาะมีขนาดใหญ่ อ้วนท้วมและมีการป้องกันตัวเองต่ำ ทำให้กลายเป็นเป้านิ่งการตอบโต้กลับคืนทางอากาศของเครื่องบินรบอังกฤษ",
            "picture": "none"
        },
        {
            "date": "31 มกราคม 1915",
            "title": "การมาของก๊าซพิษ",
            "information": "&nbsp;&nbsp;&nbsp;&nbsp;เยอรมันนำก๊าซพิษประมาณ 18,000 กระบอก มาปล่อยในแนวรบฝั่งตะวันออก เพื่อโจมตีกองกำลังของรัสเซียที่อยู่ทางตะวันตกกรุงวอร์ซอว์ ประเทศโปแลนด์ แต่ก็ส่งผลกระทบเล็กน้อยต่อกองทัพรัสเซีย เนื่องจากก๊าซพิษไม่สามารถระเหยได้ในอุณหภูมิที่เย็นจัด",
            "picture": "assets/image/ww3.gif"
        },
        {
            "date": "18 กุมภาพันธ์ 1915",
            "title": "การสู้รบด้วยเรือ U-Boat",
            "information": "&nbsp;&nbsp;&nbsp;&nbsp;เรือ U-Boat หรือ Undersea Boat เป็นเรือดำน้ำที่เยอรมันใช้เป็นอาวุธประจำกองเรือเพื่อสู้รบทางทะเลกับประเทศคู่สงคราม เนื่องจากถูกอังกฤษกักเขตฝั่งทะเลของเยอรมัน ใช้มาตราการเรียกเก็บค่าผ่านด่านทางทะเล และกีดกันการนำเข้าสินค้าต่าง ๆ เพื่อจัดการกับเรือสัญชาติเยอรมันให้หมดไปจากทะเลหลวง เริ่มต้นโจมตีเรือพาณิชย์ที่แล่นอยู่บนน่านน้ำของอังกฤษ อย่างไรก็ตามปฏิบัติการของเยอรมันที่เป็นไปอย่างฉาบฉวยและไม่จำกัดส่งผลให้สหรัฐอเมริกาที่ประกาศตัวเป็นกลางโกรธแค้นอย่างมาก เนื่องจากมีพลเรือนชาวอเมริกันเสียชีวิตในเหตุการณ์ครั้งนี้ด้วย",
            "picture": "assets/image/ub.jpg"
        },
        {
            "date": "22 เมษายน – 25 พฤษภาคม 1915",
            "title": "การปะทะครั้งที่สองที่เมืองอีพรอ(Second Battle of Ypres)",
            "information": "&nbsp;&nbsp;&nbsp;&nbsp;เมืองอีพรอ ตั้งอยู่ทางตอนเหนือของประเทศเบลเยียม เป็นพื้นที่ยุทธศาสตร์สำคัญในสงครามโลกครั้งที่ 1 เพราะเยอรมันจะสามารถตัดเส้นทางการเดินทัพและการลำเลียงเสบียงอาหารของอังกฤษ อีกทั้งยังสามารถบุกเข้าโจมตีฝรั่งเศสได้อย่างสะดวกรวดเร็ว<br>&nbsp;&nbsp;&nbsp;&nbsp;ในการปะทะครั้งที่สองในเมืองอีพรอ เยอรมันใช้ก๊าซพิษครั้งแรกในแนวรบฝั่งตะวันตกเพื่อโจมตีฐานที่มั่นของกองทัพฝรั่งเศสที่อยู่รอบ ๆ เมืองอีพรอ โดยปล่อยก๊าซพิษคลอรีนมากกว่า 5,000 กระบอก เกิดเป็นควันคล้ายเมฆสีเขียวล่องลอยในอากาศเหนือที่ตั้งกองทัพของฝรั่งเศส-แอฟริกัน ทำให้ทหารที่อยู่ในบริเวณนี้ต้องถอยล่าออกไปเนื่องจากไม่มีอุปกรณ์ป้องกันอาวุธเคมีชีวะนิวเคลียร์นี้ และความอันตรายของก๊าซพิษยังทำให้อังกฤษและแคนาดาไม่สามารถเข้าไปในพื้นที่ดังกล่าวได้ จึงต้องถอนกำลังทหารออกจากแนวการป้องกันไปอยู่รอบ ๆ เมืองอีพรอแทน การปะทะครั้งนี้ ทำให้ฝ่ายสัมพันธมิตรมีผู้เสียชีวิตทั้งหมด 58,000 คน และฝ่ายเยอรมันมีผู้เสียชีวิต 38,000 คน",
            "picture": "assets/image/ww4.jpg"
        },
        {
            "date": "มิถุนายน 1915-พฤศจิกายน 1917",
            "title": "สู้รบตามแนวแม้น้ำอิซอนโซ อิตาลี",
            "information": "none",
            "picture": "none"
        }
    ],
    [
        {
            "comment": "this is 1916"
        },
        {
            "date": "21 กุมภาพันธ์ – กรกฎาคม 1916",
            "title": "none",
            "information": "สู้รบที่แวร์เดิง ฝรั่งเศส ซึ่งเป็นสงครามที่ยาวที่สุด และมีผู้ได้รับผลกระทบเกือบล้านคน",
            "picture": "none"
        },
        {
            "date": "31 พฤษภาคม – 1 มิถุนายน 1916",
            "title": "none",
            "information": "สหราชอาณาจักรและเยอรมนีสู้รบกันที่คาบสมุทรจัตแลนด์ ทะเลเหนือใกล้เดนมาร์ก",
            "picture": "none"
        },
        {
            "date": "1 กรกฎาคม – 18 พฤศจิกายน 1916",
            "title": "none",
            "information": "&nbsp;&nbsp;&nbsp;&nbsp;หนึ่งในแนวรบฝั่งตะวันตกที่สำคัญคือสมรภูมิรบใกล้กับแม่น้ำซอมม์ โดยฝ่ายสัมพันธมิตร(อังกฤษและฝรั่งเศส)สู้รบกับฝ่ายเยอรมัน ซึ่งถือเป็นการปะทะครั้งใหญ่ที่สุดในระหว่างสงครามโลกครั้งที่ 1 มีการใช้รถถังเป็นครั้งแรก และเป็นการเข้าร่วมสงครามครั้งแรกของทหารอาสาชาวอังกฤษในนาม Kitchener's Army<br>&nbsp;&nbsp;&nbsp;&nbsp;อังกฤษและฝรั่งเศสต้องการจะใช้สมรภูมิรบบริเวณแม่น้ำซอมม์ทำลายฐานทัพเยอรมันที่ตั้งอยู่ตลอดแนวรบ เพื่อขจัดเยอรมันให้ออกจากฝรั่งเศส แต่ก็ต้องเปลี่ยนแผน เมื่อเยอรมันเข้าโจมตีฝรั่งเศสทางเมือง Verdun ทางภาคตะวันออกเฉียงเหนือของฝรั่งเศส กองทหารของฝรั่งเศสจึงถูกส่งไปรบที่นั่นแทน แต่อังกฤษก็ยังคงอยู่โจมตีที่แม่น้ำซอมม์เช่นเดิม เพื่อทำลายกองกำลังเยอรมันให้ไขว้เขว<br>&nbsp;&nbsp;&nbsp;&nbsp;ก่อนการสู้รบกันในบริเวณนี้จะเกิดขึ้นอย่างเป็นทางการ ฝ่ายสัมพันธมิตรได้เริ่มกระหน่ำยิงและทิ้งระเบิดตามแนวฝั่งกองทัพเยอรมัน เพราะเชื่อว่าจะเป็นยุทธวิธีที่ทำลายแนวรบฝ่ายเยอรมันได้ แต่อย่างไรก็ตาม ทหารเยอรมันก็ล่วงรู้ว่าจะมีการกระหน่ำยิงจากฝ่ายสัมพันธมิตร จึงได้หลบอยู่ในที่ปลอดภัยและรอคอยจนสิ้นสุดการยิง ยุทธวิธีของฝ่ายสัมพันธมิตรครั้งนี้ทำลายป้อมปราการของเยอรมันได้เพียงเล็กเท่านั้น อีกทั้งยุทโธปกรณ์ของฝ่ายสัมพันธมิตรยังทำงานได้อย่างไม่มีประสิทธิภาพ ซึ่งทำให้ฝ่ายสัมพันธมิตรปราชัยและอังกฤษต้องสูญเสียกองกำลังกว่า 18,000 คน ในวันเริ่มแรกการปะทะที่แม่น้ำซอมม์ แม้จะมีผู้เสียชีวิตจำนวนมาก แต่ฝ่ายสัมพันธมิตรก็ยังคงมุ่งหน้าโจมตีตามแนวรบต่อไป จนสามารถยึดดินแดนได้อีก 7 ไมล์ อย่างไรก็ตาม มีผู้ได้รับบาดเจ็บและเสียชีวิตมากกว่า 623,000 คน จำนวนผู้เสียชีวิตทั้งหมดทั้งสองฝ่ายรวมกันทั้งสิ้นมากกว่า 1 ล้านคน",
            "picture": "assets/image/ww5.jpg"
        }
    ],
    [
        {
            "comment": "this is 1917"
        },
        {
            "date": "ปฏิวัติรัสเซีย",
            "title": "none",
            "information": "&nbsp;&nbsp;&nbsp;&nbsp;สภาพสังคม วัฒนธรรมและเศรษฐกิจของรัสเซียก่อนการปฏิวัติ เป็นไปโดยมีกษัตริย์หรือซาร์เป็นผู้มีอำนาจสูงสุด ควบคุมกองทัพ เป็นเจ้าของที่ดิน และมีอำนาจกำหนดความเป็นไปของศาสนา ชีวิตของประชาชนและชนชั้นกรรมาชีพในช่วงการเป็นประเทศอุตสาหกรรมก็ลำบากยากแค้น ถูกกดขี่สวัสดิการและเงินเดือนจากเจ้าของโรงงาน เหล่าชนชั้นขุนนางก็ควบคุมดูแลประชาชนเยี่ยงทาสหรือสัตว์ทั้งที่มีกฎหมายเกี่ยวกับสิทธิกำหนดไว้<br>&nbsp;&nbsp;&nbsp;&nbsp;เหตุการณ์ “วันอาทิตย์เลือด” หรือ Bloody Sunday ตรงกับวันที่ 22 มกราคม 1905 เป็นเหตุการณ์สำคัญที่นำไปสู่การปฏิวัติในครั้งนี้ ชนชั้นกรรมาชีพจำนวนมากเดินขบวนไปที่พระราชวังของซาร์นิโคลัสที่ 2 ในกรุงเซนต์ปีเตอร์สเบิร์กเพื่อยื่นข้อเรียกร้องเกี่ยวกับการได้รับสภาพการทำงาน (Working Conditions) ที่ดีขึ้นเพราะคิดว่าซาร์จะช่วยเหลือพวกเขา แต่หลังจากทหารของซาร์นิโคลัสที่ 2 สลายการชุมนุมด้วยการยิงใส่ประชาชนทำให้ความเชื่อถือและศรัทธาในตัวซาร์ลดลงและแรงกระเพื่อมของความต้องการปฏิวัติก็แผ่ขยายไปทั่วประเทศ<br>&nbsp;&nbsp;&nbsp;&nbsp;นอกจากนี้ การที่รัสเซียประกาศเข้าร่วมสงครามโลกที่ 1 โดยรบกับฝ่ายเยอรมันนั้น ทำให้ทหารของรัสเซียซึ่งเป็นประชาชนชนชั้นกรรมาชีพต้องเสียชีวิตเกือบ 2 ล้านคน และอีกประมาณ 5 ล้านคนได้รับบาดเจ็บ เพราะกองทัพของรัสเซียไม่มีประสิทธิภาพเพียงพอ ทหารไม่ได้ถูกฝึกให้ชำนาญในการต่อสู้และการใช้อาวุธ ทหารจำนวนหนึ่งไม่ได้ใส่รองเท้าและไม่ได้รับอาหารเพื่อประทังชีวิตในยามสงคราม อีกทั้งต้องสู้รบด้วยมือเปล่า ทำให้พ่ายแพ้เยอรมัน เงินทุนที่นำไปใช้ในสงครามก็หมดไปอย่างเปล่าประโยชน์ ส่งผลต่อการเติบโตเศรษฐกิจของประเทศ<br>&nbsp;&nbsp;&nbsp;&nbsp;การปฏิวัติ เริ่มต้นขึ้นจากความไม่พอใจที่สั่งสมมานานของประชาชน ทำให้มีการนัดหยุดงานเพื่อประท้วงและชุมนุมทางการเมือง ซาร์นิโคลัสจึงสั่งให้ทหารในบัญชาการของพระองค์ปราบการจลาจลให้หมดสิ้น แต่ทหารไม่ปฏิบัติตามคำสั่งและเริ่มที่จะก่อกบฏร่วมกับประชาชน การปฏิวัติทำให้ซาร์ต้องสละราชสมบัติ และราชวงศ์โรมานอฟที่ปกครองประเทศมา 303 ปีต้องสิ้นสุด รัฐบาลชั่วคราวถูกจัดตั้งขึ้นมา มีพรรคการเมือง 2 พรรค ได้แก่ พรรคโปโตรกราดโซเวียต (The Petrograd Soviet) ซึ่งเป็นตัวแทนจากชนชั้นกรรมาชีพและทหาร กับพรรครัฐบาลชั่วคราว (The Provisional Government) ซึ่งเป็นคณะบุคคลที่เคยเป็นรัฐบาลของซาร์ เพียงแต่ในครั้งนี้ไม่มีซาร์เป็นผู้นำพรรค",
            "picture": "none"
        },
        {
            "date": "2 เมษายน 1917",
            "title": "none",
            "information": "&nbsp;&nbsp;&nbsp;&nbsp;ประธานาธิบดีวูดโร วิลสัน กล่าวสุนทรพจน์ในที่ประชุมสภาคองเกรส (The U.S. Congress) ว่า “The world must be made safe for democracy” เพื่อประกาศเจตนารมณ์ที่จะสร้างความมั่นคงและจัดระเบียบโลกใหม่และนำไปสู่การปกป้องและพัฒนาประชาธิปไตย",
            "picture": "assets/image/ww6.jpg"
        },
        {
            "date": "6 เมษายน 1917",
            "title": "ประกาศสงคราม",
            "information": "สหรัฐฯ ประกาศสงครามกับเยอรมนี",
            "picture": "none"
        },
        {
            "date": "26 มิถุนายน 1917",
            "title": "none",
            "information": "กองกำลังสหรัฐฯ บุกเข้าพื้นที่ฝรั่งเศส",
            "picture": "none"
        },
        {
            "date": "ตุลาคม 1917",
            "title": "ปฏิวัติเดือนตุลาคม, รัสเซีย",
            "information": "&nbsp;&nbsp;&nbsp;&nbsp;การปฏิวัติเกิดขึ้นอีกครั้งในเดือนตุลาคม (ตามปฏิทินจูเลียน) หรือในเดือนพฤศจิกายน (ตามปฏิทินเกรโกเรียน) นำโดย วลาดิเมีย เลนิน (Vladimir Lenin) ผู้นำพรรคบอลเชวิค (Bolsheviks) ที่ต้องการเปลี่ยนรัฐบาลชั่วคราวเดิมเป็นรัฐบาลตามแนวคิดคอมมิวนิสต์ของคาร์ล มาร์กซ์ รัสเซียจึงกลายเป็นประเทศแรกในโลกที่ปกครองแบบสังคมนิยมคอมมิวนิสต์<br>&nbsp;&nbsp;&nbsp;&nbsp;ชัยชนะในการปฏิวัติของพรรคบอลเชวิค นำไปสู่การสงบศึกชั่วคราวและลงนามในสนธิสัญญาสันติภาพเบรสต์-ลีโตเวส (Brest-Litovsk) กับเยอรมัน รัฐบาลใหม่ภายใต้การนำของวลาดิเมีย เลนิน ดำเนินการจัดการกับอุตสาหกรรมของประเทศ และปรับย้ายภาคการเกษตรไปสู่การเป็นอุตสาหกรรม ยึดคืนที่ดินการเพาะปลูกจากชนชั้นศักดินา แล้วแบ่งสรรให้ประชาชน อีกทั้งผู้หญิงมีสิทธิเสมอภาคเท่าเทียมกับผู้ชาย และไม่ยอมรับการมีศาสนา",
            "picture": "assets/image/ww7.jpg"
        },
        {
            "date": "20 พฤศจิกายน 1917",
            "title": "none",
            "information": "สู้รบกันที่กองเบร ฝรั่งเศส",
            "picture": "none"
        },
        {
            "date": "3 ธันวาคม 1917",
            "title": "none",
            "information": "รัสเซียเซ็นสัญญาสงบศึกกับเยอรมนีเป็นการชั่วคราว",
            "picture": "none"
        }
    ],
    [
        {
            "comment": "this is 1918"
        },
        {
            "date": "ปี 1918",
            "title": "การรุกของเยอรมันในฤดูใบไม้ผลิ(German Spring Offensive)",
            "information": "นายพลลูเดนดอฟฟ์ วางแผนการรุกในแนวรบตะวันตกซึ่งมีชื่อว่าแผนปฏิบัติการมิคาเอล (The Saint Michael Offensive) เพื่อแยกกองทัพของอังกฤษและฝรั่งเศสออกจากัน โดยกลยุทธในแผนปฏิบัติการดังกล่าว คือ จัดกองกำลังขนาดเล็ก พกอาวุธเล็ก หลอกล่อคู่ศัตรูแล้วล้อมโจมตีอย่างรวดเร็ว สามารถโจมตีกองทัพอังกฤษที่อเมนส์สามารถรุกเข้าไปได้ถึง 60 ไมล์ นอกจากนี้เยอรมันยังใช้วิธีการแทรกซึมตามแนวสนามเพลาะของฝ่ายสัมพันธมิตร กองทัพเยอรมันรุกเข้าไปใกล้กรุงปารีสมากขึ้นเท่าใด ก็ทำให้การเคลื่อนย้ายขนส่งปืนใหญ่และรถถังเป็นไปด้วยความยากลำบากมากขึ้นและการรุกก็ต้องหยุดชะงักลง เป็นโอกาสของฝ่ายสัมพันธมิตร นำโดยสหรัฐอเมริกาที่เข้ามาผลัดเปลี่ยนกับทหารฝรั่งเศสในการโจมตีทหารเยอรมันให้แตกพ่าย",
            "picture": "assets/image/ww8.jpg"
        },
        {
            "date": "3 มีนาคม 1918",
            "title": "ถอนตัว",
            "information": "รัสเซียถอนตัวจากฝ่ายสัมพันธมิตร และถอนตัวจากสงคราม",
            "picture": "none"
        },
        {
            "date": "21 มีนาคม-5 เมษายน 1918",
            "title": "none",
            "information": "สู้รบที่แม่น้ำซอมม์ ฝรั่งเศส ครั้งที่ 2",
            "picture": "none"
        },
        {
            "date": "29 กันยายน 1918",
            "title": "สงบศึก",
            "information": "เบลเยียมเซ็นสัญญาสงบศึกชั่วคราว",
            "picture": "none"
        },
        {
            "date": "30 ตุลาคม 1918",
            "title": "สงบศึก",
            "information": "จักรวรรดิออตโตมันเซ็นสัญญาสงบศึกชั่วคราว",
            "picture": "none"
        },
        {
            "date": "3 พฤศจิกายน 1918",
            "title": "สงบศึก",
            "information": "ออสเตรีย-ฮังการี เซ็นสัญญาสงบศึกชั่วคราว",
            "picture": "none"
        },
        {
            "date": "11 พฤศจิกายน 1918",
            "title": "สงบศึก",
            "information": "เมื่อชัยชนะตกเป็นของฝ่ายสัมพันธมิตร ทำให้เยอรมันต้องลงนามในสนธิสัญญาสงบศึกในฐานะผู้แพ้สงคราม การลงนามมีขึ้นในเวลา 5 นาฬิกา ที่ตู้รถไฟ สถานีรถไฟเมืองชองปาญ (Compienge) ประเทศฝรั่งเศส แต่การสู้รบตามแนวรบฝั่งตะวันตกยังคงมีไปจนถึงเวลา 11 นาฬิกาของวันเดียวกัน",
            "picture": "none"
        },
        {
            "date": "28 กรกฎาคม 1919",
            "title": "เซ็นสนธิสัญญา",
            "information": "เซ็นสนธิสัญญาแวร์ซายส์ ที่พระราชวังแวร์ซายส์ ฝรั่งเศส",
            "picture": "none"
        }
    ],
    [
        {
            "comment": "this is 1919"
        },
        {
            "date": "28 กรกฎาคม 1919",
            "title": "เซ็นสนธิสัญญา",
            "information": "เซ็นสัญญาสนธิแวร์ซายส์ ที่พระราชวังแวร์ซายส์ ฝรั่งเศส",
            "picture": "none"
        }
    ]
]