[
    [
        {
            "date": "1 มกราคม 1940",
            "information": [
                "กองทัพญี่ปุ่นโจมตีมณฑลซานซีของจีน"
            ],
            "monthNum": 1,
            "picture": "none"
        },
        {
            "date": "2 มกราคม 1940",
            "information": [
                "การรุกของโซเวียตในฟินแลนด์หยุดชะงัก ทหารฟินแลนด์ได้รับชัยชนะติดต่อกันหลายครั้ง รถถังโซเวียตถูกทำลายเป็นจำนวนมาก"
            ],
            "monthNum": 1,
            "picture": "none"
        },
        {
            "date": "7 มกราคม 1940",
            "information": [
                "สหราชอาณาจักรเริ่มปันส่วนเครื่องบริโภค"
            ],
            "monthNum": 1,
            "picture": "none"
        },
        {
            "date": "10 มกราคม 1940",
            "information": [
                "เครื่องบินเยอรมนีหลงเข้าไปในเบลเยียม และลงจอดที่ Mechelen นายทหารบก 2นายที่โดยสารมากับเครื่องบินถูกสัมพันธมิตรจับ เอกสารลับเกี่ยวกับแผนการบุกของนาซีถูกเปิดเผย ฮิตเลอร์เลื่อนแผนการบุกออกไปเพราะสภาพอากาศไม่เป็นใจ"
            ],
            "monthNum": 1,
            "picture": "none"
        },
        {
            "date": "14 มกราคม 1940",
            "information": [
                "นายพลเรือ มิตสุมาสะ โยไน ขึ้นเป็นนายกรัฐมนตรีของญี่ปุ่น"
            ],
            "monthNum": 1,
            "picture": "none"
        },
        {
            "date": "16 มกราคม 1940",
            "information": [
                "เอกสารลับของเยอรมันในการบุกสแกนดิเนเวียและเลื่อนแผนบุกฝรั่งเสสถูกเปิดเผย"
            ],
            "monthNum": 1,
            "picture": "none"
        },
        {
            "date": "17 มกราคม 1940",
            "information": [
                "ทหารโซเวียตถูกตีโต้ในฟินแลนด์ และตอบโต้โดยการส่งเครื่องบินโจมตีทางอากาศอย่างหนัก"
            ],
            "monthNum": 1,
            "picture": "none"
        },
        {
            "date": "20 มกราคม 1940",
            "information": [
                "เรืออู-44ของเยอรมันจมเรือกลไฟกรีก"
            ],
            "monthNum": 1,
            "picture": "none"
        },
        {
            "date": "21 มกราคม 1940",
            "information": [
                "เรือดำน้ำเยอรมันจมเรือ HMS Exmouth ลูกเรือเสียชีวิต 135 นาย"
            ],
            "monthNum": 1,
            "picture": "none"
        },
        {
            "date": "24 มกราคม 1940",
            "information": [
                "Richard Heydrich ได้รับการแต่งตั้งจากเกอร์ริง ในการแก้ปัญหาชาวยิว"
            ],
            "monthNum": 1,
            "picture": "none"
        },
        {
            "date": "27 มกราคม 1940",
            "information": [
                "เยอรมนีเตรียมแผนการบุกเดนมาร์กและนอร์เวย์ขั้นสุดท้าย"
            ],
            "monthNum": 1,
            "picture": "none"
        }
    ],
    [
        {
            "date": "1 กุมภาพันธ์ 1940",
            "information": [
                "เสบียงของกองทัพญี่ปุ้นสูงเป็นครึ่งหนึ่งของกองทัพ"
            ],
            "monthNum": 2,
            "picture": "none"
        },
        {
            "date": "5 กุมภาพันธ์ 1940",
            "information": [
                "คณะมนตรีสงครามของสัมพันธมิตรตัดสินใจเข้าร่วมรบในนอร์เวย์และฟินแลนด์ เพื่อตัดเส้นทางลำเลียงแร่เหล็กของสวีเดน อย่างไรก็ตาม แผนนี้พึ่งพาความช่วยเหลือของนอร์เวย์และสวีเดนที่เป็นกลาง"
            ],
            "monthNum": 2,
            "picture": "none"
        },
        {
            "date": "9 กุมภาพันธ์ 1940",
            "information": [
                "เอริก ฟอน มันชสไตน์ได้เตรียมกองพลที่ 38 ได้การโจมตีฝรั่งเศส"
            ],
            "monthNum": 2,
            "picture": "none"
        },
        {
            "date": "10 กุมภาพันธ์ 1940",
            "information": [
                "สหภาพโซเวียตตกลงที่จะส่งเสบียงและวัตถุดิบให้กับเยอรมนี ตามข้อตกลงทางการค้าฉบับใหม่"
            ],
            "monthNum": 2,
            "picture": "none"
        },
        {
            "date": "14 กุมภาพันธ์ 1940",
            "information": [
                "รัฐบาลอังกฤษประกาศหาอาสาสมัครเข้าไปช่วยเหลือฟินแลนด์"
            ],
            "monthNum": 2,
            "picture": "none"
        },
        {
            "date": "15 กุมภาพันธ์ 1940",
            "information": [
                "ฮิตเลอร์ประกาศจมเรือแบบไม่เลือกหน้า"
            ],
            "monthNum": 2,
            "picture": "none"
        },
        {
            "date": "16 กุมภาพันธ์ 1940",
            "information": [
                "เรือพิฆาตอังกฤษ คอร์แซก ทำลายความเป็นกลางของนอร์เวย์ เพื่อช่วยเหลือลูกเรือพาณิชย์ชาวอังกฤษ 299 นาย บนเรือขนส่งสัญชาติเยอรมัน อัลมาร์ค",
                "เยอรมนีเร่งความพร้อมในการรุกราน ด้วยเชื่อว่าอังกฤษจะส่งกำลังเข้ามาในนอร์เวย์"
            ],
            "monthNum": 2,
            "picture": "none"
        },
        {
            "date": "17 กุมภาพันธ์ 1940",
            "information": [
                "กองทัพฟินแลนด์ถูกบังคับให้ถอยร่นออกจากแนว Mannerheim เข้าสู่แนวป้องกันที่สอง หลังจากการโจมตีของทหารโซเวียต"
            ],
            "monthNum": 2,
            "picture": "none"
        },
        {
            "date": "24 กุมภาพันธ์ 1940",
            "information": [
                "แผนการรุกแนวรบตะวันตกถูกวิเคราะห์อีกครั้ง พื้นที่เข้าตีหลักถูกเปลี่ยนเป็น อาร์เดน จะถูกกองพลหุ้มเกราะถูกนำออกมาใช้"
            ],
            "monthNum": 2,
            "picture": "none"
        }
    ],
    [
        {
            "date": "1 มีนาคม 1940",
            "information": [
                "ฮิตเลอร์ได้เตรียมวางแผนบุกเดนมาร์กและนอร์เวย์"
            ],
            "monthNum": 3,
            "picture": "none"
        },
        {
            "date": "3 มีนาคม 1940",
            "information": [
                "โซเวียตเข้าโจมตีเมือง Viipuri เมืองใหญ่อันดับสองของฟินแลนด์ทางทิศตะวันออกเฉียงใต้ของเฮลซิงกิ"
            ],
            "monthNum": 3,
            "picture": "none"
        },
        {
            "date": "5 มีนาคม 1940",
            "information": [
                "ฟินแลนด์ส่งผู้แทนมาเจรจาสนธิสัญญาสันติภาพที่กรุงมอสโก"
            ],
            "monthNum": 3,
            "picture": "none"
        },
        {
            "date": "11 มีนาคม 1940",
            "information": [
                "สนธิสัญญาสันติภาพระหว่างโซเวียตกับฟินแลนด์ได้รับการรับรองจากทั้งสองฝ่าย หลังจากโซเวียตเอาชนะได้แบบหืดขึ้นคอ ฟินแลนด์ยังคงรักษาเอกราชเอาไว้ได้ แต่ต้องเสีย คาเรเลียและ ฮังโก ให้โซเวียต ซึ่งคิดเป็น 10% ของดินแดน"
            ],
            "monthNum": 3,
            "picture": "none"
        },
        {
            "date": "12 มีนาคม 1940",
            "information": [
                "ฟินแลนด์ได้สงบศึกกับสหภาพโซเวียตหลังจาก 105 วันหลังจากความขัดแย้งระหว่างโซเวียต-ฟินแลนด์"
            ],
            "monthNum": 3,
            "picture": "none"
        },
        {
            "date": "16 มีนาคม 1940",
            "information": [
                "เยอรมันได้โจมตีพลเรือนในเกาะอังกฤษครั้งแรก"
            ],
            "monthNum": 3,
            "picture": "none"
        },
        {
            "date": "18 มีนาคม 1940",
            "information": [
                "ฮิตเลอร์กับมุสโสลินี ได้พบกันที่ชายแดนออสเตรียและมุสโสลินีเห็นว่าเป็นโอกาสที่ดีที่จะเข้าสู่สงคราม"
            ],
            "monthNum": 3,
            "picture": "none"
        },
        {
            "date": "20 มีนาคม 1940",
            "information": [
                "นายกรัฐมนตรี Édouard Daladier ของฝรั่งเศสลาออกจากตำแหน่ง หลังถูกโจมตีเรื่องความล้มเหลวในการช่วยเหลือฟินแลนด์แต่เนิ่นๆ อันอาจจะเป็นผลให้ภัยคุกคามไม่คืบคลานเข้ามาสู่ฝรั่งเศส Paul Reynaud ขึ้นมาเป็นนายกรัฐมนตรีต่อ"
            ],
            "monthNum": 3,
            "picture": "none"
        },
        {
            "date": "28 มีนาคม 1940",
            "information": [
                "อังกฤษและฝรั่งเศสเห็นต้องกันที่จะไม่แบ่งแยกสนธิสัญญาสันติภาพกับเยอรมนี",
                "ญี่ปุ่นได้จัดตั้งรัฐบาลหุ่นเชิดของจีนที่เมืองนานกิง"
            ],
            "monthNum": 3,
            "picture": "none"
        },
        {
            "date": "30 มีนาคม 1940",
            "information": [
                "สหราชอาณาจักรได้เริ่มสอดแนมสหภาพโซเวียต"
            ],
            "monthNum": 3,
            "picture": "none"
        }
    ],
    [
        {
            "date": "8 เมษายน 1940",
            "information": [
                "อังกฤษและฝรั่งเศสวางทุ่นระเบิดในน่านน้ำนอร์เวยเจียน เพื่อป้องกันมิให้เยอรมนีขนแร่เหล็กออกจากสวีเดนสู่ทะเลหลวง ซึ่งล่าช้าไปจากแผนเดิม 3วัน และช้าเกินไปในการยับยั้งแผนการรุกรานของนาซี",
                "เรือพิฆาตอังกฤษ โกล์ววอร์มเข้าหยุดยั้งกองเรือรุกรานของเยอรมนีบริเวณนอร์เวย์ แต่ถูกยิงจม เรือดำน้ำอังกฤษสามารถจมเรือขนส่ง Rio de Janiero กองเรืออังกฤษที่ถูกส่งขึ้นไปยั้บยั้งกองเรือรุกรานของเยอรมันได้รับข้อมูลไม่เพียงพอและล้มเหลวในภารกิจ"
            ],
            "monthNum": 4,
            "picture": "none"
        },
        {
            "date": "9 เมษายน 1940",
            "information": [
                "ปฏิบัติการแวเซอรีบุง การทัพนอร์เวย์: เยอรมนีส่งกำลังเข้ารุกรานเดนมาร์กและนอร์เวย์ ทั้งทางบก, เรือ และอากาศ เดนมาร์กถูกยึดครองอย่างรวดเร็ว ฐานทัพอากาศของนอร์เวย์สองแห่งถูกโจมตี เยอรมนียกพลขึ้นบกได้สำเร็จหกจุด แต่เรือลาดตระเวน Blücher ของเยอรมนีถูกยิงจมด้วยปืนรักษาฝั่ง กะลาสีเสียชีวิต 1,600 นาย กษัตริย์ Haakon เสด็จหนีไปทางเหนือพร้อมกับรัฐบาลของพระองค์ เรือลาดตระเวนประจันบาน รอดนีย์ของอังกฤษได้รับความเสียหายจากการเข้าปะทะกับเรือลาดตระเวนประจันบานของเยอรมนี Scharnborstและ Gneisenau เรือลาดตระเวน Karisrube ถูกเรือดำน้ำอังกฤษยิงจมนอกฝั่ง Kristainsand"
            ],
            "monthNum": 4,
            "picture": "none"
        },
        {
            "date": "10-13 เมษายน 1940",
            "information": [
                "เรือพิฆาตอังกฤษ 5 ลำเข้าโจมตีเรือพิฆาต 10 ของเยอรมัน พร้อมป้อมปืนรักษาชายฝั่งอย่างฉับพลัน บริเวณตะวันตกของ Narvik เรือลาดตระเวน Königsberg ของเยอรมนีกลายเป็นเรือลำแรกที่ถูกจมด้วยเทคนิค ดำทิ้งระเบิด (Dive Bombing)"
            ],
            "monthNum": 4,
            "picture": "none"
        },
        {
            "date": "10-30 เมษายน 1940",
            "information": [
                "เยอรมันรุกคืบขึ้นทางเหนือของนอร์เวย์"
            ],
            "monthNum": 4,
            "picture": "none"
        },
        {
            "date": "14-19 เมษายน 1940",
            "information": [
                "กองกำลังฝ่ายสัมพันธมิตร 10,000 นาย ถูกเตรียมพร้อมสำหรับเข้ารบในคาบสมุทรนอร์เวย์"
            ],
            "monthNum": 4,
            "picture": "none"
        },
        {
            "date": "20-30 เมษายน 1940",
            "information": [
                "กองทหารเยอรมนีป้องกันทรอดไฮม์ ฝ่ายสัมพันธมิตรล้มเหลวในปฏิบัติการเนื่องจากเตรียมตัวที่ไม่ประสบผล"
            ],
            "monthNum": 4,
            "picture": "none"
        },
        {
            "date": "24 เมษายน 1940",
            "information": [
                "กองกำลังสัมพันธมิตรเข้าระดมยิงเมืองท่านาร์วิก จากทางทะเล"
            ],
            "monthNum": 4,
            "picture": "none"
        },
        {
            "date": "27 เมษายน 1940",
            "information": [
                "ทหารอังกฤษเริ่มถอนตัวออกจากนอร์เวย์"
            ],
            "monthNum": 4,
            "picture": "none"
        }
    ]
]