[
    [
        {
            "date": "1 กันยายน 1939",
            "information": [
                "การบุกครองโปแลนด์โดยนาซีเยอรมนี เริ่มต้นขึ้นเมื่อเวลา 4.45 น. ลุฟท์วัฟเฟอโจมตีเป้าหมายหลายแห่งในโปแลนด์ ลุฟท์วัฟเฟอเปิดฉากโจมตีทางอากาศต่อการ์กุฟ วูชและกรุงวอร์ซอ ภายในห้านาทีของการโจมตี กองทัพเรือเยอรมัน (ครีกซมารีเนอ) สั่งการให้เรือประจัญบานชเลซวิก-โฮลสไทน์อันเก่าแก่เปิดฉากยิงคลังพัสดุขนส่งทางทหารของโปแลนด์ที่เวสเทอร์เพลท (Westerplatte) ในนครเสรีดันซิก แต่การเข้าตีนี้ถูกขับกลับไป เมื่อถึงเวลา 8.00 น. กองทัพบกเยอรมัน (เวร์มัคท์เฮร์) เปิดฉากโจมตีใกล้กับเมืองม็อกรา (Mokra) ของโปแลนด์ ขณะที่ยังไม่มีการประกาศสงครามอย่างเป็นทางการ",
                "เอสโตเนีย ลัตเวีย ลิทัวเนีย นอร์เวย์ สวิตเซอร์แลนด์และฟินแลนด์ประกาศวางตัวเป็นกลางในสงคราม",
                "รัฐบาลอังกฤษประกาศระดมพล และเริ่มแผนอพยพเตรียมรับมือการเข้าตีทางอากาศของเยอรมนี"
            ],
            "monthNum": 9,
            "picture": "http://historyconflicts.com/wp-content/uploads/2015/04/invaded-poland-by-germans-soviet-union.png"
        },
        {
            "date": "2 กันยายน 1939",
            "information": [
                "สหราชอาณาจักรและฝรั่งเศสยื่นคำขาดร่วมต่อเยอรมนี ให้ส่งทหารกลับจากดินแดนโปแลนด์ ผู้เผด็จการอิตาลี เบนิโต มุสโสลินีประกาศว่าวางตัวเป็นกลาง ฝ่ายสาธารณรัฐไอร์แลนด์ก็ประกาศว่าตนเป็นกลางเช่นกัน รัฐบาลสวิตเซอร์แลนด์ประกาศระดมพล",
                "นครเสรีดันซิกถูกผนวกรวมกับเยอรมนี",
                "พระราชบัญญัติรับราชการทหาร ค.ศ. 1939 มีผลใช้บังคับทันที และเกณฑ์ชายทุกคนซึ่งมีอายุระหว่าง 18-41 ปี และพำนักอยู่ในสหราชอาณาจักร"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "3 กันยายน 1939",
            "information": [
                "เมื่อเวลา 11.15 น. ตามเวลามาตรฐานอังกฤษ เนวิลล์ เชมเบอร์แลนด์ นายกรัฐมนตรีอังกฤษ ประกาศทางสถานีวิทยุบีบีซีว่าเส้นตายที่กำหนดให้เยอรมนีถอนตัวออกจากโปแลนด์ได้สิ้นสุดลงเมื่อ 11.00 น. และกล่าวว่า เพราะฉะนั้น ชาตินี้จึงอยู่ในภาวะสงครามกับเยอรมนี ออสเตรเลีย อินเดียและนิวซีแลนด์ก็ประกาศสงครามกับเยอรมนีในไม่กี่ชั่วโมงหลังการประกาศสงครามของอังกฤษ",
                "เมื่อเวลา 12.30 น. ตามเวลามาตรฐานอังกฤษ รัฐบาลฝรั่งเศสยื่นคำขาดสุดท้ายคล้ายกัน ซึ่งสิ้นสุดลงเมื่อเวลา 15.00 น. ตามเวลามาตรฐานอังกฤษ",
                "เรือเดินสมุทร แอดเบนเนีย (Atbenia) ถูกเรือดำน้ำ อู-30 ของเยอรมนีจม เพราะถูกเข้าใจผิดว่าเป็นเรือช่วยตรวจการของอังกฤษ มีผู้เสียชีวิต 112 ราย"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "4 กันยายน 1939",
            "information": [
                "เมื่อเวลา 8.00 น. ตามเวลามาตรฐานนิวฟันด์แลนด์ ประเทศในเครือจักรภพนิวฟันแลนด์ (Dominion of Newfoundland) ประกาศสงครามกับเยอรมนี",
                "ในการปฏิบัติเชิงรุกครั้งแรกของอังกฤษในสงคราม กองทัพอากาศเปิดฉากตีโฉบฉวยกองเรือเยอรมันในอ่าวเฮลิโกแลนด์ โดยมุ่งเป้าไปยังเรือประจัญบานขนาดเล็ก (pocket-battleship) อัดมีรัลเชร์ ที่ทอดสมออยู่นอกวิลเฮล์มชาเวนที่ตะวันตกสุดของคลองคีล อากาศยานหลายลำสูญหายไปในการเข้าตีนี้ และ แม้เรือจะถูกยิงสามครั้ง แต่ระเบิดทุกลูกไม่ระเบิด",
                "ญี่ปุ่นประกาศวางตัวเป็นกลางต่อสถานการณ์ในทวีปยุโรป ฝ่ายกระทรวงกองทัพเรืออังกฤษประกาศเริ่มต้นการปิดล้อมทางทะเลต่อเยอรมนี เป็นหนึ่งในหลายมาตรการที่อังกฤษดำเนินการสงครามเศรษฐกิจต่อฝ่ายอักษะ",
                "สหรัฐอเมริกาเริ่มการลาดตระเวนความเป็นกลาง"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "5 กันยายน 1939",
            "information": [
                "นายกรัฐมนตรีแอฟริกาใต้ แบร์รี่ เฮอร์ซอก ล้มเหลวในการหาเสียงสนับสุนในการประกาศวางตัวเป็นกลาง และถูกปลดโดยการประชุมลับของพรรคการเมือง และแทนที่ด้วยรองนายกรัฐมนตรีแจน สมุทส์",
                "สหรัฐอเมริกาประกาศวางตัวเป็นกลางต่อสาธารณะ"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "6 กันยายน 1939",
            "information": [
                "แอฟริกาใต้ประกาศสงครามกับเยอรมนี",
                "กองทัพเยอรมนียึดเมืองการ์กุฟ ทางตอนใต้ของโปแลนด์ กองทัพโปแลนด์ล่าถอยครั้งใหญ่"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "7 กันยายน 1939",
            "information": [
                "ฝรั่งเศสเริ่มการรุกพอเป็นพิธี โดยเคลื่อนเข้าไปในดินแดนของเยอรมนีใกล้กับซาร์บรือเคน",
                "สหราชอาณาจักรผ่านพระราชบัญญัติว่าด้วยการขึ้นทะเบียนแห่งชาติ เริ่มใช้บัตรประชาชน รัฐบาลมีอำนาจในการควบคุมแรงงาน"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "8 กันยายน 1939",
            "information": [
                "สหราชอาณาจักรนำระบบขบวนเรือในความคุ้มกัน (convoy) กลับมาใช้ใหม่กับเรือพาณิชย์ และปิดล้อมการเดินเรือของเยอรมนีเต็มขั้น",
                "รัฐบาลสหราชอาณาจักรประกาศระบบคุ้มกันเรือพาณิชย์อีกครั้ง และกีดกันเรือสินค้าของเยอรมนีอย่างเต็มที่",
                "กองพลที่ 10 แห่งเยอรมนี ภายใต้การนำของนายพลวอลเทอร์ วอน ไรเชนนาว รุกคืบถึงขอบกรุงวอร์ซอว์ของโปแลนด์ กองพลที่ 14 โดยนายพลวิลเฮล์ม ลิสท์รุกถึงแม่น้ำซาน และกองพันแพนเซอร์ของนายพลไฮนส์ กูเดอเรี่ยน รุกถึงแม่น้ำบั๊ก ทางตะวันออกของกรุงวอร์ซอว์"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "9 กันยายน 1939",
            "information": [
                "การรุกซาร์ลันท์ของฝรั่งเศสหยุดชะงักที่ป่าวาร์นดท์ที่มีการวางทุ่นระเบิดหนาแน่น หลังรุกเข้าไปในดินแดนเยอรมนีที่มีการป้องกันเบาบาง 8 ไมล์"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "10 กันยายน 1939",
            "information": [
                "แคนาดาประกาศสงครามกับเยอรมนี",
                "กองทัพหลักของอังกฤษยกพลขึ้นบกที่ฝรั่งเศสเพื่อช่วยรบต่อต้านเยอรมนี นำโดย นายพล ลอร์ด โกร์ท มีจำนวนทหาร 160,000 นาย พร้อมยานพาหนะ 24,000 คัน"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "11 กันยายน 1939",
            "information": [
                "ผู้สำเร็จราชการอินเดีย ลอร์ดลินลิธโกว์ ประกาศต่อสภานิติบัญญัติทั้งสองของอินเดีย (สภาแห่งรัฐและสภานิติบัญญัติ) ว่าเนื่องจากการเข้าร่วมสงคราม การวางแผนการจัดตั้งสหพันธรัฐอินเดียจึงถูกเลื่อนออกไป"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "12 กันยายน 1939",
            "information": [
                "พลเอกเกมลินสั่งหยุดการรุกเข้าไปในเยอรมนี"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "15 กันยายน 1939",
            "information": [
                "กองทัพโปแลนด์ได้รับคำสั่งให้ต้านทานที่พรมแดนโรมาเนียกระทั่งฝ่ายสัมพันธมิตรมาถึง"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "16 กันยายน 1939",
            "information": [
                "กองทัพเยอรมนีล้อมกรุงวอร์ซอ เมืองหลวงของโปแลนด์ สมบูรณ์",
                "ฝรั่งเศสเสร็จสิ้นการร่นถอยออกจากเยอรมนี สิ้นสุดการรุกซาร์"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "17 กันยายน 1939",
            "information": [
                "สหภาพโซเวียตบุกครองโปแลนด์จากทิศตะวันออก ยึดครองดินแดนทางตะวันออกของแนวคูร์ซอน เช่นเดียวกับเบียลีสตอกและกาลีเซียตะวันออก",
                "เรือบรรทุกเครื่องบิน เรือหลวง คะเรเจิส ถูกเรืออู-29 จมระหว่างการลาดตระเวนนอกชายฝั่งตะวันตกเฉียงใต้ของไอร์แลนด์",
                "กองทัพจักรวรรดิญี่ปุ่นเปิดฉากโจมตีนครฉางชาของจีน เมื่อกำลังญี่ปุ่นทางเหนือของมณฑลเจียงซีเข้าตีไปทางตะวันตกสู่มณฑลเหอหนาน"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "18 กันยายน 1939",
            "information": [
                "ประธานาธิบดีโปแลนด์ Ignacy Mościcki และผู้บัญชาการทหาร Edward Rydz-Śmigły หลบหนีจากโปแลนด์ไปยังโรมาเนีย ที่ซึ่งถูกกักตัวทั้งคู่ กำลังรัสเซียไปถึงวิลนีอุสและเบรสต์-ลีตอฟสค์ เรือดำน้ำโปแลนด์หลบหนีจากกรุงทาลลินน์ ทำให้ความเป็นกลางของเอสโตเนียถูกสหภาพโซเวียตและเยอรมนีตั้งคำถาม"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "19 กันยายน 1939",
            "information": [
                "กองทัพเยอรมนีและโซเวียตบรรจบกันใกล้เมืองเบรสต์-ลีตอฟสค์",
                "กองทัพโซเวียตปิดล้อมท่าทาลลินน์ เมืองหลวงของเอสโตเนีย",
                "สหภาพโซเวียตและมองโกเลีย พันธมิตร ชนะยุทธการคาลคินโกล เหนือญี่ปุ่น ยุติสงครามชายแดนโซเวียต-ญี่ปุ่น",
                "กองทัพจักรวรรดิญี่ปุ่นเข้าตีกองทัพปฏิวัติแห่งชาติจีนตามแม่น้ำซินเชียงโดยใช้แก๊สพิษระหว่างยุทธการฉางชา"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "20 กันยายน 1939",
            "information": [
                "เรือดำน้ำ อู-27 ของเยอรมนี ถูกจมโดยระเบิดน้ำลึกจากเรือประจัญบานอังกฤษ"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "21 กันยายน 1939",
            "information": [
                "นายกรัฐมนตรีโรมาเนีย Armand Calinescu ถูกพวกคลั่งชาติในพื้นที่นาม ผู้พิทักษ์เหล็ก' (Iron Guard) ลอบสังหาร"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "24 กันยายน 1939",
            "information": [
                "กองทัพอากาศโซเวียตละเมิดน่านฟ้าของเอสโตเนีย ผู้แทนเอสโตเนียเดินทางไปเจรจากับโมโลตอฟที่กรุงมอสโก โมโลตอฟขู่ว่าสหภาพโซเวียตจะดำเนินการอย่างรุนแรงหากเอสโตเนียไม่ยอมให้มีการตั้งฐานทัพโซเวียตในดินแดนเอสโตเนีย"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "25 กันยายน 1939",
            "information": [
                "ประเทศเยอรมนีเริ่มการปันส่วนอาหาร",
                "สหภาพโซเวียตได้เตรียมกำลังพล 160,000นาย รถถัง 600 คัน และเครื่องบินรบ600ลำ ตามแนวชายแดนเอสโตเนีย"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "26 กันยายน 1939",
            "information": [
                "หลังจากการระดมยิงปืนใหญ่ ทหารเยอรมนีเข้าตีกรุงวอร์ซอว์",
                "เครื่องบินทิ้งระเบิดของโซเวียตบินเหนือน่านฟ้าเมืองทาลลินน์"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "27 กันยายน 1939",
            "information": [
                "ปืนใหญ่แห่งแนวซิกฟรีดเปิดฉากระดมยิงหมู่บ้านในประเทศฝรั่งเศสเบื้องหลังแนวมากิโนต์"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "28 กันยายน 1939",
            "information": [
                "กองทัพส่วนที่เหลือและทหารชาวบ้านของโปแลนด์ยอมแพ้ที่กรุงวอร์ซอว์",
                "กองทัพโซเวียตประชิดชายแดนลัตเวีย น่านฟ้าลัตเวียถูกละเมิด",
                "สนธิสัญญามิตรภาพและพรมแดนระหว่างเยอรมนี-โซเวียตได้รับการลงนามโดยโมโลตอฟและริบเบนทรอพ โดยมีภาคผนวกลับที่เปลี่ยนแปลงการปักปันดินแดนที่เคยตกลงกันไว้ในสนธิสัญญาโมโลตอฟ-ริบเบนทรอพ โดยยกลิทัวเนียให้แก่สหภาพโซเวียต แต่เยอรมนีจะได้รับดินแดนในโปแลนด์มากขึ้น"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "29 กันยายน 1939",
            "information": [
                "เอสโตเนียยอมเซ็นสัญญาความช่วยเหลือร่วมกันกับสหภาพโซเวียตเป็นเวลา 10 ปี ซึ่งอนุญาตให้มีทหารโซเวียตประจำในแลตเวียจำนวน 30,000 นาย ซึ่งเป็นของตอบแทนสตาลินที่ให้คำมั่นว่าจะธำรงเอกราชของเอสโตเนีย",
                "โซเวียตเริ่มแผ่กำลังเข้าควบคุมคาบสมุทรบอลติกเพื่อระวังการรุกรานของนาซี"
            ],
            "monthNum": 9,
            "picture": "none"
        },
        {
            "date": "30 กันยายน 1939",
            "information": [
                "ราชนาวีเยอรมีนจมเรือพาณิชย์อังกฤษนอกชายฝั่งของประเทศบราซิล"
            ],
            "monthNum": 9,
            "picture": "none"
        }
    ],
    [
        {
            "date": "2 ตุลาคม 1939",
            "information": [
                "ผู้แทนจากแลตเวียเจรจากับสตาลินและโมโลตอฟ สหภาพโซเวียตขู่ว่าจะใช้กำลังคุกคามถ้าหากไม่ได้ตั้งฐานทัพในลัตเวีย",
                "อเมริกาเห็นด้วยกับคำแถลงการณ์ที่ปานามา การกระทำทางสงครามจะต้องไม่เกิดขึ้นบริเวณผิวน้ำรอบทวีปอเมริกา อาณาเขตเป็นกลางกว้างประมาณ 300 ไมล์จะมีกองทัพเรือสหรัฐอเมริกาลาดตระเวน"
            ],
            "monthNum": 10,
            "picture": "none"
        },
        {
            "date": "3 ตุลาคม 1939",
            "information": [
                "กองทัพอังกฤษเคลื่อนทัพสู่ชายแดนเบลเยี่ยม เพื่อป้องกันการรุกรานมาทางทิศตะวันตกของเยอรมัน",
                "ผู้แทนลิทัวเนียพบสตาลินและเมโลตอฟในกรุงมอสโก สตาลินเสนอจะให้เมืองวิลนิอัสของโปแลนด์แก่ลิทัวเนียถ้าหากยอมรับข้อตกลง ผู้แทนต้องยอมรับข้อเสนออย่างเสียไม่ได้"
            ],
            "monthNum": 10,
            "picture": "none"
        },
        {
            "date": "5 ตุลาคม 1939",
            "information": [
                "ลัตวียเซ็นสัญญาความร่วมมือร่วมกันกับสหภาพโซเวียตเป็นเวลา 10 ปี ซึ่งอนุญาตให้มีทหารโซเวียตกว่า 25,000 นายประจำในลัตเวีย สตาลินให้คำมั่นว่าจะเคารพเอกราชของแลตเวีย"
            ],
            "monthNum": 10,
            "picture": "none"
        },
        {
            "date": "6 ตุลาคม 1939",
            "information": [
                "กองทัพจีนมีชัยเหนือกองทัพญี่ปุ่นในการต่อสู้ที่ฉางชา",
                "การต่อต้านของชาวโปแลนด์สิ้นสุดลง ฮิตเลอร์กล่าวปราศรัยต่อหน้าสภาไรซ์ตาร์กว่าตนจะปรึกษาการฟื้นฟูสันติภาพกับอังกฤษและฝรั่งเศส"
            ],
            "monthNum": 10,
            "picture": "none"
        },
        {
            "date": "7 ตุลาคม 1939",
            "information": [
                "ผุ้แทนลิทัวเนียมายังกรุงมอสโก โซเวียตยังต้องการที่จะสร้างฐานทัพในลิทัวเนีย"
            ],
            "monthNum": 10,
            "picture": "none"
        },
        {
            "date": "9 ตุลาคม 1939",
            "information": [
                "ฮิตเลอร์ประกาศคำสั่งเตรียมบุกเบลเยียม ฝรั่งเศส ลักเซมเบิร์ก และเนเธอร์แลนด์"
            ],
            "monthNum": 10,
            "picture": "none"
        },
        {
            "date": "10 ตุลาคม 1939",
            "information": [
                "กองทัพโปแลนด์กองสุดท้ายยอมจำนนต่อกองทัพเยอรมัน",
                "เชมเบอร์แลนด์ นายกรัฐมนตรีอังกฤษได้ปฏิเสธข้อเสนอของฮิตเลอร์",
                "ลิทัวเนียเซ็นสัญญาความร่วมมือร่วมกันกับสหภาพโซเวียตเป็นเวลา 15 ปี ซึ่งอนุญาตให้มีทหารโซเวียตกว่า 20,000 นายประจำการในลิทัวเนีย"
            ],
            "monthNum": 10,
            "picture": "none"
        },
        {
            "date": "11 ตุลาคม 1939",
            "information": [
                "ทหารอังกฤษประมาณ 158,000 นายอยู่ในฝรั่งเศส"
            ],
            "monthNum": 10,
            "picture": "none"
        },
        {
            "date": "12 ตุลาคม 1939",
            "information": [
                "ผู้นำฝรั่งเศสปฏิเสธข้อเสนอสันติภาพของฮิตเลอร์",
                "ผู้แทนจากฟินแลนด์เข้าพบสตาลินและโมโลทอฟที่กรุงมอสโก สหภาพโซเวียตต้องการให้ฟินแลนด์ถอนฐานทัพใกล้กับเมืองเฮลซิงกิ และปรึกษากันเพื่อปกป้องเลนินกราดจากสหราชอาณาจักรหรือการรุกรานจากเยอรมนีในอนาคต"
            ],
            "monthNum": 10,
            "picture": "none"
        },
        {
            "date": "14 ตุลาคม 1939",
            "information": [
                "ผู้แทนจากฟินแลนด์เข้าพบสตาลินอีกครั้ง สตาลินขู่ว่าหากการเจรจายืดเยื้อ อาจมีเหตุไม่คาดฝันเกิดขึ้นระหว่างกองทหารโซเวียตและฟินแลนด์ได้",
                "เรืออู-47 ฝ่าแนวป้องกันของอังกฤษที่อ็อร์คนีย์ ซึ่งกองเรืออังกฤษเทียบท่าอยู่ ส่งผลให้เรือหลวง รอแยล โอ็ค จมมีกะลาสีเสียชีวิต 786 นาย"
            ],
            "monthNum": 10,
            "picture": "none"
        },
        {
            "date": "16 ตุลาคม 1939",
            "information": [
                "การโจมตีทางอากาศครั้งแรกในสหราชอาณาจักร"
            ],
            "monthNum": 10,
            "picture": "none"
        },
        {
            "date": "18 ตุลาคม 1939",
            "information": [
                "กองทัพชุดแรกของสหภาพโซเวียตเข้ามายังเอสโตเนีย"
            ],
            "monthNum": 10,
            "picture": "none"
        },
        {
            "date": "19 ตุลาคม 1939",
            "information": [
                "เกตโตหรือสลัมสำหรับชาวยิว ได้ก่อสร้างขึ้นในเมือง Lublin"
            ],
            "monthNum": 10,
            "picture": "none"
        },
        {
            "date": "20 ตุลาคม 1939",
            "information": [
                "สงครามลวง ทหารฝรั่งเศสตั้งมั่นตามแนวเมกิโนต์ ส่วนทหารอังกฤษสร้างแนวสนามเพลาะระหว่างแนวเมกิโนต์กับช่องแคบอังกฤษ"
            ],
            "monthNum": 10,
            "picture": "none"
        },
        {
            "date": "27 ตุลาคม 1939",
            "information": [
                "เบลเยียมประกาศวางตัวเป็นกลาง"
            ],
            "monthNum": 10,
            "picture": "none"
        },
        {
            "date": "30 ตุลาคม 1939",
            "information": [
                "สหราชอาณาจักรรายงานว่ามีค่ายกักกันสำหรับชาวยิวและผู้ที่ต่อต้านนาซีกำลังก่อสร้างในยุโรป"
            ],
            "monthNum": 10,
            "picture": "none"
        },
        {
            "date": "31 ตุลาคม 1939",
            "information": [
                "นาซีเยอรมนีได้ทีแผนบุกฝรั่งเศส โดยพลโท เอริก ฟอน มันชสไตน์วางแผนที่จะโจมตีผ่าน Ardennes มากกว่าการบุกเบลเยี่ยม"
            ],
            "monthNum": 10,
            "picture": "none"
        }
    ],
    [
        {
            "date": "1 พฤศจิกายน 1939",
            "information": [
                "ฉนวนโปแลนด์ถูกผนวกเข้ากับเยอรมนี ส่วนดินแดนทางตะวันออกของโปแลนด์ถูกผนวกรวมกับยูเครนและเบโลรุสเซียของสหภาพโซเวียต"
            ],
            "monthNum": 11,
            "picture": "none"
        },
        {
            "date": "3 พฤศจิกายน 1939",
            "information": [
                "ฟินแลนด์และสหภาพโซเวียตเจรจาเกี่ยวกับแนวชายแดนอีกครั้ง ฟินแลนด์ไม่ไว้ใจเจตนาของสตาลินและไม่ยอมยกดินแดนที่เป็นแนวป้องกันประเทศให้"
            ],
            "monthNum": 11,
            "picture": "none"
        },
        {
            "date": "4 พฤศจิกายน 1939",
            "information": [
                "ชาวยิวในกรุงวอร์ซอว์ประมาณ 400,000 คนได้รับคำสั่งให้ย้ายไปยังชุมชนชาวยิว",
                "สหรัฐอเมริกาผ่านร่างกฎหมายยอมให้มีการค้าขายอาวุธกับรัฐใดก็ตามที่มีเงินจ่าย ซึ่งเป็นร่างกฎหมายที่เอื้อประโยชน์ให้ประเทศฝั่งสัมพันธมิตร"
            ],
            "monthNum": 11,
            "picture": "none"
        },
        {
            "date": "8 พฤศจิกายน 1939",
            "information": [
                "ฮิตเลอร์ได้กล่าวถึงการหนีในเหตุการณ์โรงเบียร์มิวนิกในปี 1923 ในวันนั้นกองทัพอากาศอังกฤษเข้าทิ้งระเบิดใส่เมืองมิวนิด"
            ],
            "monthNum": 11,
            "picture": "none"
        },
        {
            "date": "13 พฤศจิกายน 1939",
            "information": [
                "มีการระเบิดครั้งแรกในสหราชอาณาจักร บริเวณหมู่เกาะเชตแลนด์นอกชายฝั่งสกอตแลนด์ เกิดความเสียหายเล็กน้อย",
                "การเจรจาแนวชายแดนระหว่างฟินแลนด์และสหภาพโซเวียตล้มเหลว ฟินแลนด์สงสัยว่าฟินแลนด์อาจเป็นส่วนหนึ่งในข้อตกลงระหว่างเยอรมนี-สหภาพโซเวียต"
            ],
            "monthNum": 11,
            "picture": "none"
        },
        {
            "date": "14 พฤศจิกายน 1939",
            "information": [
                "รัฐบาลพลัดถิ่นโปแลนด์หลบหนีไปยังกรุงลอนดอน"
            ],
            "monthNum": 11,
            "picture": "none"
        },
        {
            "date": "16 พฤศจิกายน 1939",
            "information": [
                "กองทัพอากาศเยอรมันทิ้งระเบิดในเมือง Oakney ของสกอตแลนด์"
            ],
            "monthNum": 11,
            "picture": "none"
        },
        {
            "date": "17 พฤศจิกายน 1939",
            "information": [
                "IRA ถูกกล่าวหาว่าก่อระเบิดขึ้นในลอนดอน"
            ],
            "monthNum": 11,
            "picture": "none"
        },
        {
            "date": "20 พฤศจิกายน 1939",
            "information": [
                "กองทัพเยอรมันเริ่มต้นปฏิบัติการการทำเหมืองแร่ที่แม่น้ำเทมส์"
            ],
            "monthNum": 11,
            "picture": "none"
        },
        {
            "date": "24 พฤศจิกายน 1939",
            "information": [
                "ญี่ปุ่นยึดเมืองหนานหนิงทางภาคใต้ของประเทศจีน"
            ],
            "monthNum": 11,
            "picture": "none"
        },
        {
            "date": "26 พฤศจิกายน 1939",
            "information": [
                "สหภาพโซเวียตเริ่มเคลื่อนไหวตามแนวชายแดนฟินแลนด์"
            ],
            "monthNum": 11,
            "picture": "none"
        },
        {
            "date": "29 พฤศจิกายน 1939",
            "information": [
                "สหภาพโซเวียตยุติสัมพันธ์ทางการทูตกับฟินแลนด์"
            ],
            "monthNum": 11,
            "picture": "none"
        },
        {
            "date": "30 พฤศจิกายน 1939",
            "information": [
                "สงครามฤดูหนาว สหภาพโซเวียตโจมตีฟินแลนด์"
            ],
            "monthNum": 11,
            "picture": "none"
        }
    ],
    [
        {
            "date": "1 ธนวาคม 1939",
            "information": [
                "สหภาพโซเวียตทำสงครามกับฟินแลนด์ กรุงเฮลซิงกิถูกทิ้งระเบิดทางอากาศ ช่วงสองสัปดาห์แรกของเดือนธันวาคม ทหารฟินแลนด์ล่าถอยไปยังแนวแมนเนอร์ไฮม์ซึ่งเป็นแนวป้องกันเก่าบริเวณชายแดนภาคใต้ที่ติดกับสหภาพโซเวียต"
            ],
            "monthNum": 12,
            "picture": "none"
        },
        {
            "date": "2 ธนวาคม 1939",
            "information": [
                "ฟินแลนด์ยื่นคำร้องต่อสันนิบาตชาติเพื่อให้ยุติสงครามฤดูหนาว ซึ่งสันนิบาตชาติเห็นด้วยที่จะให้โซเวียตถอนตัวแต่ถูกปฏิเสธ",
                "สหราชอาณาจักรกำหนดให้ชายอายุ 19 ถึง 41 ปี เข้าเกณฑ์ทหาร"
            ],
            "monthNum": 12,
            "picture": "none"
        },
        {
            "date": "5 ธนวาคม 1939",
            "information": [
                "สหภาพโซเวียตโจมตีแนวแมนเนอร์เฮมรุนแรงขึ้น"
            ],
            "monthNum": 12,
            "picture": "none"
        },
        {
            "date": "7 ธนวาคม 1939",
            "information": [
                "อิตาลีประกาศเป็นกลางอีกครั้ง นอร์เวย์ สวีเดน และเดนมาร์กประกาศเป็นกลางในกรณีพิพาทระหว่างฟินแลนด์-โซเวียต",
                "กรมทหารที่ 163 ของโซเวียตเคลื่อนทัพถึงหมู่บ้าน Suomussali ทางตะวันออกของฟินแลนด์ และต้องหยุดทัพไว้เนื่องจากความหนาวเหน็บ และถูกโจมตีโดยกรมทหารที่ 9ของฟินแลนด์ที่พยายามรักษาเส้นทางลำเลียงเสบียง ด้านกรมทหารที่ 44 ของโซเวียตเองก็ถูกตรึงเอาไว้เช่นกัน กรมทหารทั้งสองของโซเวียตพยายามฝ่าแนวต้านทานไปจนกระทั่งปลายปี ก่อนจะยอมจำนน"
            ],
            "monthNum": 12,
            "picture": "none"
        },
        {
            "date": "11 ธนวาคม 1939",
            "information": [
                "สหภาพโซเวียตประสบความพ่ายแพ้ทางยุทธวิธีหลายครั้ง"
            ],
            "monthNum": 12,
            "picture": "none"
        },
        {
            "date": "12 ธนวาคม 1939",
            "information": [
                "เรืออังกฤษสองลำประทะกันนอกชายฝั่งของสกอตแลนด์"
            ],
            "monthNum": 12,
            "picture": "none"
        },
        {
            "date": "13 ธนวาคม 1939",
            "information": [
                "ยุทธนาวีแม่น้ำปลาเต้ เรือลาดตระเวนหนักของอังกฤษ เอ๊กเตอร์ พร้อมด้วยเรือลาดตระเวนเบา อาเจ็กซ์ และ อาชิลลิสต์ เข้าปะทะกับเรือประจันบาน กราฟ สปีร์ ของเยอรมนี ณ ปากแม่น้ำปลาเต้ นอกชายฝังอุรุกวัย ไม่มีเรือลำใดจม กราฟ สปีร์ หนีไปได้"
            ],
            "monthNum": 12,
            "picture": "none"
        },
        {
            "date": "14 ธนวาคม 1939",
            "information": [
                "สหภาพโซเวียตถูกถอดถอนจากการเป็นสมาชิกองค์กรสันนิบาตชาติ"
            ],
            "monthNum": 12,
            "picture": "none"
        },
        {
            "date": "15 ธนวาคม 1939",
            "information": [
                "สหภาพโซเวียตปะทะกับฟินแลนด์ที่ Taipale"
            ],
            "monthNum": 12,
            "picture": "none"
        },
        {
            "date": "16 ธนวาคม 1939",
            "information": [
                "กองพลที่ 7 ของโซเวียตเดินทางมาถึงแนวแมนเนอร์ไฮม์ และเริ่มปฏิบัติการเข้าตีครั้งใหญ่"
            ],
            "monthNum": 12,
            "picture": "none"
        },
        {
            "date": "17 ธนวาคม 1939",
            "information": [
                "เรือกราฟสปีร์ของเยอรมันได้ออกจากมอนเตวิโอ ออกไปจากน่านน้ำอุรุกวัย พร้อมลูกเรืออีก 200 คน"
            ],
            "monthNum": 12,
            "picture": "none"
        },
        {
            "date": "18 ธนวาคม 1939",
            "information": [
                "กองทัพแคนาดาหน่วยแรกเดินทางถึงยุโรป"
            ],
            "monthNum": 12,
            "picture": "none"
        },
        {
            "date": "19 ธนวาคม 1939",
            "information": [
                "เยอรมันสามารถป้องกันการโจมตีทางอากาศของอังกฤษได้"
            ],
            "monthNum": 12,
            "picture": "none"
        },
        {
            "date": "20 ธนวาคม 1939",
            "information": [
                "ฮันส์ แลงสตอร์ฟ ผู้บัญชาการเรือกราฟสปีร์ฆ่าตัวตาย"
            ],
            "monthNum": 12,
            "picture": "none"
        },
        {
            "date": "23 ธนวาคม 1939",
            "information": [
                "กองทหารแคนนาดาจำนวน 7,500 นายเดินทางถึงอังกฤษ"
            ],
            "monthNum": 12,
            "picture": "none"
        },
        {
            "date": "27 ธนวาคม 1939",
            "information": [
                "กองทัพอินเดียหน่วยแรกเดินทางถึงฝรั่งเศส"
            ],
            "monthNum": 12,
            "picture": "none"
        },
        {
            "date": "28 ธนวาคม 1939",
            "information": [
                "สหราชอาณาจักรจำกัดปริมาณเนื้อสัตว์"
            ],
            "monthNum": 12,
            "picture": "none"
        },
        {
            "date": "29 ธนวาคม 1939",
            "information": [
                "ฟินแลนด์ค่อนข้างประสบความสำเร็จในการทำลายกองทหารและยุทธโธปกรณ์ของฝ่ายโซเวียต"
            ],
            "monthNum": 12,
            "picture": "none"
        }
    ]
]